src/cf/Catalogs/вогШаблоныПроизвольныйКодСтатусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>вогШаблоныПроизвольныйКодСтатусы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОбработчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогТипыОбработчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизволныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/вогТипыОбработчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>вогТипыОбработчика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Статус</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/вогШаблоныПроизвольныйКодСтатусы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВходящийТипОбработчика = Неопределено;
	
	Если Параметры.ПараметрыВыбора.Свойство("ТипОбработчика",ВходящийТипОбработчика) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ТипОбработчика","Видимость",Ложь);
		Объект.ТипОбработчика = ВходящийТипОбработчика;
		ОтобразитьКомпиляцию();
	ИначеЕсли Параметры.Ключ.Пустая() Тогда
		Объект.ТипОбработчика = Перечисления.вогТипыОбработчика.Статус;
		ОтобразитьКомпиляцию();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОбработчикаПриИзменении(Элемент)
	ОтобразитьКомпиляцию();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтобразитьКомпиляцию()

	Если Объект.ТипОбработчика = Перечисления.вогТипыОбработчика.Обработка Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ДекорацияПроцедураСервер","Видимость",Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ДекорацияИмяПроцедурыКлиент","Видимость",Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ДекорацияПроцедураСервер","Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ДекорацияИмяПроцедурыКлиент","Видимость",Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
